<?php
$sum = 0;

for($i = 0; $i <= 9; $i++) {
    for($j = 0; $j <= 9; $j++) {
        for($k = 0; $k <= 9; $k++) {
            for($a = 0; $a <= 9; $a++) {
                for($b = 0; $b <= 9; $b++) {
                    for($c = 0; $c <= 9; $c++) {
                        if ($i + $j + $k == $a + $b + $c) { 
                            $sum += 1;
                        } else {
                            $sum += 0;
                        }
                    }
                }
            }
        }
    }

}
echo "Количество счастливых билетов: $sum";